Autodesk.Revit.DB.BuiltInFailures.HostObjFailures.ReferencesNulled
One or more references are or have become invalid.

Autodesk.Revit.DB.BuiltInFailures.HostObjFailures.HostMismatch
Can't use this type in this host.

Autodesk.Revit.DB.BuiltInFailures.HostObjFailures
Failures about HostObj.